export const email = /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/
export const phone = /^1(3\d|4[5-9]|5[0-35-9]|6[2567]|7[0-8]|8\d|9[0-35-9])\d{8}$/
// 强密码(必须包含大小写字母数字和特殊字符的组合，长度在8-20之间)：
export const password = /^(?=.*\d)(?=.*[a-z])(?=.*[A-Z])(?=.*[!@#$%^&*?]).{8,20}$/
// 强密码(必须包含大小写字母和数字的组合，不能使用特殊字符，长度在 8-20 之间)：
export const password2 = /^(?=.*\d)(?=.*[a-z])(?=.*[A-Z])[a-zA-Z0-9]{8,20}$/
// 身份证号(15位、18位数字)，最后一位是校验位，可能为数字或字符X：
export const idcard = /(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)/
